[
  {
    "word": "a",
    "meaning": "not any particular or certain one of a class or group:\na man; a chemical; a house., a certain; a particular:\none at a time; two of a kind; A Miss Johnson called., another; one typically resembling:\na Cicero in eloquence; a Jonah., one (used before plural nouns that are preceded by a quantifier singular in form): a hundred men (compare hundreds of men); a dozen times (compare dozens of times)., indefinitely or nonspecifically (used with adjectives expressing number):\na great many years; a few stars., one (used before a noun expressing quantity):\na yard of ribbon; a score of times., any; a single: not a one., each; every; per:\nten cents a sheet; three times a day., Informal. , a reduced, unstressed form of of (often written as part of a single, unhyphenated word):\ncloth a gold; time a day; kinda; sorta., a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word):\nWe shoulda gone., he1., she., it1., they., I2., are; ares., all:\nfor a' that., the first letter of the English alphabet, a vowel., any spoken sound represented by the letter A or a, as in bake, hat, father, or small., something having the shape of an A., a written or printed representation of the letter A or a., a device, as a printer's type, for reproducing the letter A or a., Electricity. , ampere; amperes., Physics. , angstrom; angstroms., answer., British. , arterial (used with a road number to designate a major highway):\nTake the A525 to Ruthin., the first in order or in a series., Sometimes a ., (in some grading systems) a grade or mark, as in school or college, indicating the quality of a student's work as excellent or superior., (in some school systems) a symbol designating the first semester of a school year., Music., the sixth tone in the scale of C major or the first tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the sixth tone of the scale of C major, called la., the tonality having A as the tonic note., Physiology. , a major blood group, usually enabling a person whose blood is of this type to donate blood to persons of group A or AB and to receive blood from persons of O or A., Sometimes a . , the medieval Roman numeral for 50 or 500., Chemistry. , (formerly) argon., Chemistry, Physics. , mass number. , Biochemistry. , adenine. , alanine , Also a .Logic. , universal affirmative. , British. , a designation for a motion picture recommended as suitable for adults., a proportional shoe width size, narrower than B and wider than AA., a proportional brassiere cup size, smaller than B and larger than AA., a quality rating for a corporate or municipal bond, lower than AA and higher than BBB., a reduced form of the Old English preposition on, meaning “on,” “in,” “into,” “to,” “toward,” preserved before a noun in a prepositional phrase, forming a predicate adjective or an adverbial element (afoot; abed; ashore; aside; away), or before an adjective (afar; aloud; alow), as a moribund prefix with a verb (acknowledge), and in archaic and dialectal use before a present participle in -ing (set the bells aringing); and added to a verb stem with the force of a present participle (ablaze; agape; aglow; astride; and originally, awry)., a reduced form of the Old English preposition of: akin; afresh; anew., an old point-action prefix, not referring to an act as a whole, but only to the beginning or end: She arose (rose up). They abided by their beliefs (remained faithful to the end)., variant of ab- before p and v: aperient; avert., variant of ad-, used: (1) before sc, sp, st (ascend) and (2) in words of French derivation (often with the sense of increase, addition):\namass., variant of an-1 before a consonant, meaning “not,” “without”:\namoral; atonal; achromatic., atomic (used in combination):\nA-bomb; A-plant., a plural ending of nouns borrowed from Greek and Latin:\nphenomena; criteria; data; errata; genera., a feminine singular ending of nouns borrowed from Latin and Greek, also used in New Latin coinages to Latinize bases of any origin, and as a Latin substitute for the feminine ending -ē of Greek words:\nanabaena;\ncinchona;\npachysandra., an ending of personal names forming feminines from masculines:\nGeorgia; Roberta., a suffix designating the oxide of the chemical element denoted by the stem:\nalumina; ceria; thoria., angstrom., year., before., about., acre; acres., active., adjective., alto., ampere; amperes., anonymous., answer., are; ares., Baseball. , assist; assists., year., before., Absolute., Academy., acre; acres., America., American., angstrom., answer., April., Artillery., used preceding a singular countable noun, if the noun is not previously specified or known, used preceding a proper noun to indicate that a person or thing has some of the qualities of the one named, used preceding a noun or determiner of quantity, used preceding a noun indicating a concrete or abstract thing capable of being divided, (preceded by once, twice, several times, etc) , each or every; per, a certain; one, (preceded by not) , any at all, an informal or dialect word for have they'd a said if they'd known, (usually linked to the preceding noun) an informal form of of sorta sad; a kinda waste, acceleration, are(s) (metric measure of land), atto-, chess See algebraic notation, the first letter and first vowel of the modern English alphabet, any of several speech sounds represented by this letter, in English as in take, bag, calm, shortage, or cobra, Also called: alpha , the first in a series, esp the highest grade or mark, as in an examination, from A to Z , from start to finish, thoroughly and in detail, Scot variants of all, music, a note having a frequency of 440 hertz (A above middle C) or this value multiplied or divided by any power of 2; the sixth note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, a human blood type of the ABO group, containing the A antigen, (in Britain) a major arterial road, (formerly, in Britain), a film certified for viewing by anyone, but which contains material that some parents may not wish their children to see, (as modifier), mass number, the number 10 in hexadecimal notation, cards , ace, chem , argon (now superseded by Ar), ampere(s), Also: at , ampere-turn, absolute (temperature), (in circuit diagrams) ammeter, area, (in combination) , atomic, chem , affinity, biochem , adenine, logic , a universal affirmative categorical proposition, such as all men are mortal: often symbolized as SaP, a person whose job is in top management, or who holds a senior administrative or professional position, (as modifier), Austria (international car registration), not; without; opposite to, on; in; towards, literary, or archaic (used before a present participle) , in the act or process of, in the condition or state of, angstrom unit, acre(s) or acreage, America(n), answer, Abbreviation of adenine, ampere, angstrom, area, A prefix meaning without or not when forming an adjective (such as amorphous, without form, or atypical, not typical), and absence of when forming a noun (such as arrhythmia, absence of rhythm). Before a vowel or h it becomes an- (as in anhydrous, anoxia)., Abbreviation of angstrom"
  },
  {
    "word": "b",
    "meaning": "Physics., bar; bars., barn; barns., the second letter of the English alphabet, a consonant., any spoken sound represented by the letter B or b, as in bid, bauble, or daubed., something having the shape of a B., a written or printed representation of the letter B or b., a device, as a printer's type, for reproducing the letter B or b., Chess. , bishop (def. 3)., Black1. , Photography. , bulb (def. 8)., the second in order or in a series., (sometimes lowercase) , (in some grading systems) a grade or mark, as in school or college, indicating the quality of a student's work as good or better than average., (sometimes lowercase) , (in some school systems) a symbol designating the second semester of a school year., Physiology. , a major blood group usually enabling a person whose blood is of this type to donate blood to persons of type B or AB and to receive blood from persons of type O or B., Music., the seventh tone in the scale of C major or the second tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the seventh tone of the scale of C major, called ti., the tonality having B as the tonic note., (sometimes lowercase) , the medieval Roman numeral for 300., Chemistry. , boron., a proportional shoe width size, narrower than C and wider than A., a proportional brassiere cup size, smaller than C and larger than A., Physics. , magnetic induction (def. 1). , Electricity. , susceptance. , a designation for a motion picture made on a low budget and meant as the secondary part of a double feature., a quality rating for a corporate or municipal bond, lower than BB and higher than CCC., (in designations of aircraft) bomber:\nB-29., bachelor., bale., Baseball. , base; baseman., bass., basso., bay., billion., blend of; blended., book., born., breadth., brother., brotherhood., bachelor., bacillus., Baseball. , base; baseman., bass., basso., bay., Bible., bolivar., boliviano., book., born., breadth., British., brother., brotherhood., chess See algebraic notation, the second letter and first consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiced bilabial stop, as in bell, Also: beta , the second in a series, esp the second highest grade in an examination, music, a note having a frequency of 493.88 hertz (B above middle C) or this value multiplied or divided by any power of 2; the seventh note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, the supporting or less important of two things, a human blood type of the ABO group, containing the B antigen, (in Britain) a secondary road, the number 11 in hexadecimal notation, chem , boron, magnetic flux density, chess , bishop, (on Brit pencils, signifying degree of softness of lead) black, Also: b physics , bel, physics , baryon number, balboa, belga, bolivar, photog , B-setting, a person whose job is in middle management, or who holds an intermediate administrative or professional position, (as modifier), Belgium (international car registration), bomber, born, cricket , bowled, (on maps, etc) bay, British"
  },
  {
    "word": "c",
    "meaning": "(with a year) about:\nc1775., Optics. , candle; candles., cycle; cycles., Physics, Optics. , the speed of light in a vacuum: standardized as 186,282.4 miles per second (299,792,458 meters per second)., Physics, Acoustics. , the speed of sound., (in prescriptions) with., capitals and small capitals., the third letter of the English alphabet, a consonant., any spoken sound represented by the letter C or c, as in cat, race, or circle., something having the shape of a C., a written or printed representation of the letter C or c., a device, as a printer's type, for reproducing the letter C or c., Computers. , a high-level programming language: very powerful and flexible, it is used in a wide variety of applications., cocaine., Grammar. , complement (def. 6)., consonant (def. 1)., Electricity. , coulomb., county (used with a number to designate a county road):\nC55., the third in order or in a series., (in some grading systems) a grade or mark, as in school or college, indicating the quality of a student's work as fair or average., Music., the first tone, or keynote, in the scale of C major or the third tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the first tone of the scale of C major, called do., the tonality having C as the tonic note., a symbol indicating quadruple time and appearing after the clef sign on a musical staff., the Roman numeral for 100., Celsius (defs. 2, 3)., centigrade (def. 2)., Electricity. , capacitance (def. 3). , a battery size for 1.5 volt dry cells: diameter, 1 inch (2.5 centimeters); length, 1.9 inches (4.8 centimeters)., Chemistry. , carbon (def. 1). , Physics. , charge conjugation , charm1 (def. 9). , Biochemistry. , cysteine. , cytosine. , Also C-note. Slang. , a hundred-dollar bill., a proportional shoe width size, narrower than D and wider than B., a proportional brassiere cup size, smaller than D and larger than B., the lowest quality rating for a corporate or municipal bond., (in designations of transport aircraft) cargo:\nC-54; C-124., gallon., Optics. , candle; candles., carat., carbon., carton., case., Baseball. , catcher., cathode., cent; cents., centavo., Football. , center., centigrade., centime., centimeter., century., chairman; chairperson., chapter., chief., child., church., cirrus., city., cloudy., cognate., color., copper., copyright., corps., cubic., cycle; cycles., Calorie., Cape., Catholic., Celsius., Celtic., Centigrade., College., (in Costa Rica and El Salvador) colon; colons., Congress., Conservative., centi-, cubic, cycle, maths , constant, specific heat capacity, the speed of light and other types of electromagnetic radiation in a vacuum, chess See algebraic notation, the third letter and second consonant of the modern English alphabet, a speech sound represented by this letter, in English usually either a voiceless alveolar fricative, as in cigar, or a voiceless velar stop, as in case, the third in a series, esp the third highest grade in an examination, something shaped like a C, (in combination), music, a note having a frequency of 261.63 hertz (middle C) or this value multiplied or divided by any power of 2; the first degree of a major scale containing no sharps or flats (C major), a key, string, or pipe producing this note, the major or minor key having this note as its tonic, a time signature denoting four crotchet beats to the bar, chem , carbon, biochem , cytosine, capacitance, heat capacity, cold (water), physics , compliance, Celsius, centigrade, century, coulomb, (Roman numeral) , 100, Cuba (international car registration), a computer programming language combining the advantages of a high-level language with the ability to address the computer at a level comparable with that of an assembly language, cargo transport, carat, cricket , caught, cent(s), century or centuries, (used esp preceding a date) circa, (on maps as part of name) Cape, Catholic, Celtic, Conservative, Corps, care of, The symbol for the speed of light in a vacuum., Abbreviation of capacitance, capacitor, capacity, Celsius, charge conjugation, coulomb, cytosine, A programming language developed in 1972 and commonly used for writing professional software. With only a small number of built-in functions, it requires less memory than other languages, and because most if its functions are not specific to particular computers, it can be used on many different kinds of machines. The Unix operating system was written in C."
  },
  {
    "word": "d",
    "meaning": "contraction of had:\nI was glad they'd gone., contraction of did:\nWhere'd they go?, contraction of should or would:\nHe'd like to go. I'd like to remind you of your promise., contraction of -ed:\nShe OK'd the plan., de (used in French names as an elided form of de):\nCharles Louis d'Albert., di (used in Italian names as an elided form of di):\nGabriele d'Annunzio., Informal. , contraction of do or did before you:\nHow d'you like your eggs cooked? D'you go to the movies last night?, the fourth letter of the English alphabet, a consonant., any spoken sound represented by the letter D or d, as in dog, ladder, ladle, or pulled., something having the shape of a D., a written or printed representation of the letter D or d., a device, as a printer's type, for reproducing the letter D or d., Electricity. , debye; debyes., deep., depth., Optics. , diopter (def. 1)., divorced., Dutch (def. 7)., the fourth in order or in a series., (sometimes lowercase) , (in some grading systems) a grade or mark, as in school or college, indicating the quality of a student's work as poor or barely passing., (sometimes lowercase) , a classification, rating, or the like, indicating poor quality., Music., the second tone in the scale of C major, or the fourth tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the second tone of the scale of C major, called re., the tonality having D as the tonic note., (sometimes lowercase) , the Roman numeral for 500., Chemistry. , deuterium. , Electricity. , electric displacement., a battery size for 1.5 volt dry cells: diameter, 1.3 inches (3.3 centimeters); length, 2.4 inches (6 centimeters)., Biochemistry. , aspartic acid. , a symbol for a shoe width size narrower than E and wider than C., a proportional brassiere cup size larger than C., Symbol, Biochemistry. , (of a molecule) having a configuration resembling the dextrorotatory isomer of glyceraldehyde: always printed as a small capital, roman character (distinguished from l-)., dextrorotatory; dextro- (distinguished from l-)., (in prescriptions) give., British. , pence., date., daughter., day., deceased., deep., degree., delete., Physics. , density., depth., deputy., dialect., dialectal., diameter., died., dime., dividend., dollar; dollars., dose., drachma., day., December., Democrat., Democratic., Physics. , density., Deus., Deuteronomy., Doctor., dose., Dutch., the fourth letter and third consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiced alveolar stop, as in dagger, the semicircle on a billiards table having a radius of 11 1/2 inches and its straight edge in the middle of the baulk line, physics , density or relative density, maths , a small increment in a given variable or function: used to indicate a derivative of one variable with respect to another, as in d y /d x, chess See algebraic notation, would or had, Deutsch: indicating the serial number in the catalogue (1951) of the musical compositions of Schubert made by Otto Deutsch (1883–1967), music, a note having a frequency of 293.66 hertz (D above middle C) or this value multiplied or divided by any power of 2; the second note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, chem , deuterium, maths , the first derivative of a function, as in D(x ³ + x ²) = 3 x ² + 2 x, physics, dispersion, electric displacement, aeronautics , drag, a semiskilled or unskilled manual worker, or a trainee or apprentice to a skilled worker, (as modifier), (Roman numeral) , 500, Germany (international car registration), Australian informal, defence, Australian informal, defensive play, (in animal pedigrees) dam, daughter, British currency , penny or pennies, diameter, died, dinar(s), dollar(s), drachma(s), US politics , Democrat(ic), government , Department, dinar(s), Don (a Spanish title), Duchess, Duke, (in the US and Canada) Doctor, Abbreviation of diameter"
  },
  {
    "word": "e",
    "meaning": "electron., Physics. , elementary charge., Mathematics. , a transcendental constant equal to 2.7182818 …, used as the base of natural logarithms; the limit of the expression (1+1/n)n as n approaches infinity., Logic. , universal negative., the fifth letter of the English alphabet, a vowel., any spoken sound represented by the letter E or e, as in met, meet, mere, etc., something having the shape of an E., a written or printed representation of the letter E or e., a device, as a printer's type, for reproducing the letter E or e., east., eastern., English (def. 5)., excellent., Expressway., the fifth in order or in a series., (sometimes lowercase) , (in some grading systems) a grade or mark, as in school or college, indicating the quality of a student's work is in need of improvement in order to be passing., Music., the third tone in the scale of C major or the fifth tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the third tone of the scale of C major, called mi., the tonality having E as the tonic note., (sometimes lowercase) , the medieval Roman numeral for 250., Physics, Electricity., electric field, electric field strength., Physics. , energy (def. 8)., Biochemistry. , glutamic acid. , Logic. , universal negative. , a proportional shoe width size narrower than EE and wider than D., variant of ex-1 occurring in words of Latin origin before consonants other than c, f, p, q, s, and t::\nemit., electric:\ne-bike., electronic:\ne-book;\ne-cigarette., on the internet; online:\ne-content;\ne-commerce., involving electronic data transfer, especially over the internet:\ne-banking., eldest., Football. , end., engineer., engineering., entrance., Baseball. , error; errors., Earl., Earth., east., Easter., eastern., engineer., engineering., English., the fifth letter and second vowel of the modern English alphabet, any of several speech sounds represented by this letter, in English as in he, bet, or below, maths , a transcendental number, fundamental to mathematics, that is the limit of (1 + 1 /n) n as n increases to infinity: used as the base of natural logarithms. Approximate value: 2.718 282…; relation to π: e πi = –1, where i = √–1, electron, chess See algebraic notation, earth, East, English, Egypt(ian), exa-, music , a note having a frequency of 329.63 hertz (E above middle C) or this value multiplied or divided by any power of 2; the third note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, physics , energy, electric field strength, electromotive force, Young's modulus (of elasticity), logic , a universal negative categorical proposition, such as no pigs can fly: often symbolized as SeP, a person without a regular income, or who is dependent on the state on a long-term basis because of unemployment, sickness, old age, etc, (as modifier), Spain (international car registration), informal , the drug ecstasy, out, away, outside, completely, without, electronic, indicating the involvement of the internet, used with numbers indicating a standardized system within the European Union, as of recognized food additives or standard pack sizes, Earl, An irrational number, with a numerical value of 2.718281828459.... It is mathematically defined as the limit of (1 + 1n)n as n grows infinitely large. It is the base of natural logarithms and has many applications in mathematics, especially in expressions involving exponential growth and decay."
  },
  {
    "word": "f",
    "meaning": "firm1., Photography. , f-number., Music. , forte2., Optics. , focal length (def. 1)., Mathematics. , function (of). See function (def. 4d)., the sixth letter of the English alphabet, a consonant., any spoken sound represented by the letter F or f, as in fat, differ, or huff., something having the shape of an F., a written or printed representation of the letter F or f., a device, as a printer's type, for reproducing the letter F or f., female (def. 7)., Genetics. , filial (def. 3)., firm., franc; francs., French1 (def. 3)., the sixth in order or in a series., (sometimes lowercase) , (in some grading systems) a grade or mark that indicates academic work of the lowest quality; failure., Music., the fourth tone in the scale of C major or the sixth tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the fourth tone of the scale of C major, called fa., the tonality having F as the tonic note., (sometimes lowercase) , the medieval Roman numeral for 40., Fahrenheit (def. 2)., Mathematics., field (def. 15)., function (of). See function (def. 4d)., (sometimes lowercase)Electricity. , farad. , Chemistry. , fluorine. , (sometimes lowercase)Physics. , force (def. 12b). , frequency (def. 3b). , fermi. , Biochemistry. , phenylalanine. , (in designations of aircraft) fighter:\nF-105., f-number., (in prescriptions) make., (in prescriptions) let them be made., (in prescriptions) let it be made; let there be made., (in the Netherlands) guilder; guilders., farad., farthing., father., fathom., feet., female., feminine., filly., fine., fluid (ounce)., folio., following., foot., form., formed of., franc., from., Mathematics. , function (of)., Fahrenheit., February., Fellow., forint., franc; francs., France., French., Friday., the sixth letter and fourth consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiceless labio-dental fricative, as in fat, music , forte: an instruction to play loudly, physics , frequency, (formerly in the Netherlands) guilder, maths , function (of), physics , femto-, chess See algebraic notation, f-number, music, a note having a frequency of 349.23 hertz (F above middle C) or this value multiplied or divided by any power of 2; the fourth note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, Fahrenheit, Fellow, chem , fluorine, Helmholtz function, physics , force, franc(s), farad(s), genetics , a generation of filial offspring, F 1 being the first generation of offspring, F 2 being the second generation, etc, France (international car registration), fighter, fathom(s), female, grammar , feminine, plural ff. or FF. , folio, plural ff. , following (page), Abbreviation of Fahrenheit"
  },
  {
    "word": "g",
    "meaning": "Psychology. , general intelligence., good., gram; grams., Electronics. , grid., acceleration of gravity., gravity (def. 5)., the seventh letter of the English alphabet, a consonant., any spoken sound represented by the letter G or g, as in get, German, or camouflage., something having the shape of a G., a written or printed representation of the letter G or g., a device, as a printer's type, for reproducing the letter G or g., Aerospace. , gravitational force:\nThe pilot pulled 3 Gs during the steep dive., Trademark. , general: a rating assigned to a movie by the MPA indicating that the film is suitable for general audiences, or children as well as adults., Informal. , grand: a sum of one thousand dollars., gay., Psychology. , general intelligence., German (def. 4)., good., the seventh in order or in a series., Music., the fifth tone in the scale of C major or the seventh tone in the relative minor scale, A minor., a string, key, or pipe tuned to this tone., a written or printed note representing this tone., (in the fixed system of solmization) the fifth tone of the scale of C major, called sol., the tonality having G as the tonic note., (sometimes lowercase) , the medieval Roman numeral for 400., Electricity., conductance., gauss (def. 1)., Physics, Astronomy. , gravitational constant., Biochemistry., glycine., guanine., gauge., gender., general., generally., genitive., going back to., gold., grain; grains., gram; grams., Football. , guard., British. , guinea., gun., German (def. 4). , gourde; gourdes., (specific) gravity., Gulf., gallon(s), gram(s), acceleration of free fall (due to gravity) near the surface of the earth, grav, chess See algebraic notation, the seventh letter and fifth consonant of the modern English alphabet, a speech sound represented by this letter, in English usually either a voiced velar stop, as in grass, or a voiced palato-alveolar affricate, as in page, music, a note having a frequency of 392 hertz (G above middle C) or this value multiplied or divided by any power of 2; the fifth note of the scale of C major, a key, string, or pipe producing this note, the major or minor key having this note as its tonic, gauss, gravitational constant, physics , conductance, biochem , guanine, German, Gibbs function, giga, good, slang, mainly US , grand (a thousand dollars or pounds), (in Australia) , general exhibition (used to describe a category of film certified as suitable for viewing by anyone), (as modifier), Gulf, guilder(s), guinea(s), A symbol for g-force., Abbreviation of gram, A symbol for g-force., Abbreviation of guanine"
  },
  {
    "word": "h",
    "meaning": "hard., Planck's constant., the eighth letter of the English alphabet, a consonant., any spoken sound represented by the letter H or h, as in hot or behave., something having the shape of an H., a written or printed representation of the letter H or h., a device, as a printer's type, for reproducing the letter H or h., hard., Grammar. , head., Electricity. , henry., Slang. , heroin., high., the eighth in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 200., Chemistry. , hydrogen., Biochemistry. , histidine., Physics., enthalpy., horizontal component of the earth's magnetic field., magnetic intensity., Music. , the letter used in German to indicate the tone B., harbor., hard., hardness., heavy sea., height., hence., high., Baseball. , hit; hits., horns., Also hr.  , hour; hours., hundred., husband., (in prescriptions) an hour., the eighth letter and sixth consonant of the modern English alphabet, a speech sound represented by this letter, in English usually a voiceless glottal fricative, as in hat, something shaped like an H, (in combination), physics , Planck constant, hecto-, chess See algebraic notation, chem , hydrogen, physics, magnetic field strength, Hamiltonian, electronics , henry or henries, thermodynamics , enthalpy, (on Brit pencils, signifying degree of hardness of lead) hard, slang , heroin, Hungary (international car registration), harbour, height, hour, husband, Abbreviation of height"
  },
  {
    "word": "i",
    "meaning": "Also called imaginary unit. , the imaginary number ., a unit vector on the x-axis of a coordinate system., the ninth letter of the English alphabet, a vowel., any spoken sound represented by the letter I or i, as in big, nice, or ski., something having the shape of an I., a written or printed representation of the letter I or i., a device, as a printer's type, for reproducing the letter I ori., the nominative singular pronoun, used in referring to oneself, the person speaking, writing, or otherwise communicating., (used to denote the narrator of a literary work written in the first person singular)., Metaphysics. , the ego., interstate (used with a number to designate an interstate highway):\nI-95., the ninth in order or in a series., (sometimes lowercase) , the Roman numeral for 1., Chemistry. , iodine., Biochemistry. , isoleucine., Electricity. , current (def. 13)., Logic. , particular affirmative., (italics)Physics. , isotopic spin. , variant of y-., the typical ending of the first element of compounds of Latin words, as -o- is of Greek words, but often used in English with a first element of any origin, if the second element is of Latin origin:\ncuneiform; Frenchify., imperator., incisor., interest., intransitive., island., isle; isles., Independent., Island; Islands., Isle; Isles., the imaginary number √–1, the ninth letter and third vowel of the modern English alphabet, any of several speech sounds represented by this letter, in English as in bite or hit, something shaped like an I, (in combination), dot the i's and cross the t's , to pay meticulous attention to detail, (subjective) , refers to the speaker or writer, chem , iodine, physics , current, physics , isospin, logic , a particular affirmative categorial statement, such as some men are married, often symbolized as SiP, (Roman numeral) , one, Italy (international car registration), used between elements in a compound word, of or relating to a region or people, esp of the Middle East, International, Island or Isle, The number whose square is equal to -1. Numbers expressed in terms of i are called imaginary or complex numbers., The symbol for electric current."
  },
  {
    "word": "j",
    "meaning": "Mathematics. , a unit vector on the y-axis of a coordinate system., Engineering. , the imaginary number ., the tenth letter of the English alphabet, a consonant., any spoken sound represented by the letter J or j, as in just, major, or rajah., something having the shape of a J., a written or printed representation of the letter J or j., a device, as a printer's type, for reproducing the letter J or j., Jewish (def. 1)., Physics. , joule; joules., the tenth in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 1., Cards. , Jack., Journal., Judge., Justice., maths , the unit vector along the y -axis, Also called: i obsolete , the imaginary number √–1, the tenth letter and seventh consonant of the modern English alphabet, a speech sound represented by this letter, in English usually a voiced palato-alveolar affricate, as in jam, cards , jack, joule(s), current density, Japan (international car registration), Abbreviation of joule"
  },
  {
    "word": "k",
    "meaning": "Mathematics. , a vector on the z-axis, having length 1 unit., Boltzmann constant., the eleventh letter of the English alphabet, a consonant., any sound represented by the letter K or k, as in bilk, kit, or sick., something having the shape of a K., a written or printed representation of the letter K or k., a device, as a printer's type, for reproducing the letter K or k., the number 1000:\nThe salary offered is $20K., kilometer, especially in a footrace or wheelchair race on a road or track:\nShe’s training to run her first 10K this summer., Chess. , king., Physics. , Kelvin., Music. , Köchel listing., kindergarten:\na K–12 boarding school., Real Estate. , kitchen., the eleventh in order or in a series., Computers., the number 1024 or 210:\nA binary 32K memory has 32,768 positions., kilobyte., Baseball. , strikeout; strikeouts., Physics. , kaon., Biochemistry. , lysine., Chemistry. , potassium., carrying capacity., Electricity. , capacity., karat., kilogram; kilograms., Chess. , king., knight., knot., kopeck., kip; kips., Knight., kwacha., kilo(s), maths , the unit vector along the z-axis, the 11th letter and 8th consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiceless velar stop, as in kitten, See five Ks, Köchel: indicating the serial number in the catalogue (1862) of the works of Mozart made by Ludwig von Köchel (1800–77), kelvin(s), chess , king, chem , potassium, physics , kaon, currency, kina, kip, kopeck, kwacha, kyat, one thousand, computing , a unit of 1024 words, bits, or bytes, (not in technical usage) 1000, Cambodia (international car registration), Abbreviation of kelvin"
  },
  {
    "word": "l",
    "meaning": "large., liter; liters., the 12th letter of the English alphabet, a consonant., any spoken sound represented by the letter L or l, as in let, dull, cradle., something having the shape of an L., a written or printed representation of the letter L or l., a device, as a printer's type, for reproducing the letter L or l., an elevated railroad., ell1., British. , pound; pounds., Optics. , lambert; lamberts., language., large., Latin., left., length., long: denoting a size longer than regular, especially for suits and coats made for tall men: 40L., longitude., Theater. , stage left., Economics. , a broad measure of total U.S. liquid assets, issued periodically by the Federal Reserve Board., the 12th in order or in a series., (sometimes lowercase) , the Roman numeral for 50., Electricity. , inductance., Physics. , kinetic potential., Biochemistry. , leucine., (of a molecule) having a configuration resembling the levorotatory isomer of glyceraldehyde: printed as a small capital, roman character (distinguished from d-)., levorotatory; levo- (distinguished from d-)., Chemistry. , levo-., U.S. Military. , (in designations of light aircraft) liaison:\nL-15., large., latitude., law., leaf., league., left., length., plural ll., , line., link., (in Italy) lira; lire., liter; liters., long., book., place., Lady., Lake., large., Latin., latitude., law., left., lempira; lempiras., leu; lei., lev; leva., Liberal., (in Italy) lira; lire., Lord., Low., lumen., Theater. , stage left., litre, physics , lepton number, the 12th letter and ninth consonant of the modern English alphabet, a speech sound represented by this letter, usually a lateral, as in label, something shaped like an L, (in combination), ell (unit), lambert(s), large, Latin, (on British motor vehicles) learner driver, physics , length, live, currency , pound, lempira, lek, leu, lire, aeronautics , lift, electronics , inductor (in circuit diagrams), physics , latent heat, physics , self-inductance, chem , the Avogadro constant, (Roman numeral) , 50, Luxembourg (international car registration), lake, left, length, Abbreviation of length, liter"
  },
  {
    "word": "m",
    "meaning": "Physics. , mass., Finance. , (of bonds) matured., medieval., medium., meter; meters., middle., Music. , minor. , magnetic pole strength., contraction of am:\nI'm not thirsty., the thirteenth letter of the English alphabet, a consonant., any spoken sound represented by the letter M or m, as in my, summer, or him., something having the shape of an M., a written or printed representation of the letter M or m., a device, as a printer's type, for reproducing the letter M or m., Printing. , em., mach., Music. , major., male., married., Medieval., medium., mega-., Middle., modal auxiliary., modifier., Economics. , monetary aggregate: issued periodically by the Federal Reserve Board as various measures of money supply (M-1, M-1A, M-2 , etc.)., British. , motorway (used with a road number to designate a major highway): the M1., the thirteenth in order or in a series., (sometimes lowercase) , the Roman numeral for 1000., Electricity. , magnetization (def. 2)., Biochemistry. , methionine., variant of Mac-., meta-., (referring especially to the use of wireless electronic devices) mobile:\nm-commerce; m-business., U.S. Military. , (used to designate the production model of military equipment, as the M-1 rifle.), noon., (in prescriptions) mix., male., (in Germany) mark; marks., married., masculine., Physics. , mass., medium., meter., middle., mile., minute., modification of., modulus., molar., month., moon., morning., mouth., noon., Majesty., Manitoba., markka; markkaa., Marquis., Music. , measure., medicine., medium., meridian., Monday., plural MM. , Monsieur., mountain., metre(s), mile(s), milli-, minute(s), the 13th letter and tenth consonant of the modern English alphabet, a speech sound represented by this letter, usually a bilabial nasal, as in mat, (verb) , am, (noun) , madam, mach, medium (size), mega-, currency , mark(s), million, astronomy , Messier catalogue; a catalogue published in 1784, in which 103 nebulae and clusters are listed using a numerical system, Middle, physics , modulus, (in Britain) motorway, (in Australia) , mature audience (used to describe a category of film certified as suitable for viewing by anyone over the age of 15), (as modifier), logic , the middle term of a syllogism, physics , mutual inductance, chem , molar, (Roman numeral) , 1000, Malta (international car registration), a variant of Mac-, indicating the use of mobile-communications technology, short for meta- (def. 4), cricket , maiden (over), male, mare, married, masculine, Majesty, (in titles) Member, million, Also: M plural MM or MM French , Monsieur, mountain, Abbreviation of mass, meter"
  },
  {
    "word": "n",
    "meaning": "Physics. , neutron., Optics. , index of refraction., a shortened form of and:\nStop 'n save.\nLook 'n listen., the 14th letter of the English alphabet, a consonant., any spoken sound represented by the letter N or n, as in now, dinner, son, etc., something having the shape of an N., a written or printed representation of the letter N or n., a device, as a printer's type, for reproducing the letter N or n., Physics. , newton; newtons., north., northern., the 14th in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 90., Chemistry., nitrogen., Avogadro's number., Biochemistry. , asparagine., Mathematics. , an indefinite, constant whole number, especially the degree of a quantic or an equation, or the order of a curve., Chess. , knight., Printing. , en., Physics. , neutron number. , an abbreviated form of normal, used in the names of hydrocarbon compounds that have a normal or straight chain of carbon atoms:\nn-3 fatty acid., variant of -an after a vowel:\nVirginian., born., name., nephew., Commerce. , net., neuter., new., nominative., noon., Chemistry. , normal (strength solution)., north., northern., Finance. , note., noun., number., Nationalist., Navy., New., Noon., Chemistry. , normal (strength solution)., Norse., north., northern., Finance. , note., November., neutron, optics , index of refraction, nano-, an indefinite number (of), the 14th letter and 11th consonant of the modern English alphabet, a speech sound represented by this letter, usually an alveolar nasal, as in nail, Also: kt chess , knight, neper, neutral, newton(s), chem , nitrogen, North, Avogadro's number, noun, Norway (international car registration), chem short for normal (def. 6), natus, neuter, new, nominative, noun, Abbreviation of newton"
  },
  {
    "word": "o",
    "meaning": "a shortened form of of, as in o'clock or will-o'-the-wisp., Chiefly Dialect. , a shortened form of on., the fifteenth letter of the English alphabet, a vowel., any spoken sound represented by the letter O or o, as in box, note, short, or love., something having the shape of an O., a written or printed representation of the letter O or o., a device, as a printer's type, for reproducing the letter O or o., (used before a name in direct address, especially in solemn or poetic language, to lend earnestness to an appeal):\nHear, O Israel!, (used as an expression of surprise, pain, annoyance, longing, gladness, etc.), the exclamation “O.”, Grammar. , object (def. 7)., Old., the fifteenth in order or in a series., the Arabic cipher; zero., (sometimes lowercase) , the medieval Roman numeral for 11., Physiology. , a major blood group, usually enabling a person whose blood is of this type to donate blood to persons of group O, A, B, or AB and to receive blood from persons of group O., Chemistry. , oxygen., Logic. , particular negative., a prefix meaning “descendant,” in Irish family names:\nO'Brien; O'Connor., an abridgment of ortho-., variant of ob- before m:\nomission., variant of oo-:\noidium., the typical ending of the first element of compounds of Greek origin (as -i- is, in compounds of Latin origin), used regularly in forming new compounds with elements of Greek origin and often used in English as a connective irrespective of etymology:\nFranco-Italian; geography; seriocomic; speedometer., a suffix occurring as the final element in informal shortenings of nouns (ammo; combo; condo; limo; promo); -o also forms nouns, usually derogatory, for persons or things exemplifying or associated with that specified by the base noun or adjective (cheapo; pinko; sicko; weirdo; wino)., a suffix occurring in colloquial noun or adjective derivatives, usually grammatically isolated, as in address:\ncheerio; kiddo; neato; righto., pint., octavo., off., old., only., order., Baseball. , out; outs., (in prescriptions) a pint., Ocean., octavo., October., Ohio., Old., Ontario., Oregon., the 15th letter and fourth vowel of the modern English alphabet, any of several speech sounds represented by this letter, in English as in code, pot, cow, move, or form, another name for nought, informal, or archaic shortened form of of a cup o' tea, chem , oxygen, a human blood type of the ABO group, logic , a particular negative categorial proposition, such as some men are not married: often symbolized as SoP, Australian slang , offence, a variant spelling of oh, an exclamation introducing an invocation, entreaty, wish, etc, (in surnames of Irish Gaelic origin) descendant of, short for ortho- (def. 4), used to connect elements in a compound word, forming informal and slang variants and abbreviations, esp of nouns"
  },
  {
    "word": "p",
    "meaning": "Music. , softly (def. 2)., penny; pence., the sixteenth letter of the English alphabet, a consonant., any spoken sound represented by the letter P or p, as in pet, supper, top, etc., something having the shape of a P., a written or printed representation of the letter P or p., a device, as a printer's type, for reproducing the letter P or p., Education. , (as a rating of student performance) passing., Chess. , pawn., Electronics. , plate., poor., Grammar. , predicate., Protestant., the 16th in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 400., Genetics. , parental (def. 4)., Chemistry. , phosphorus (def. 1)., Physics., power (def. 15a)., pressure (def. 2)., Chemistry., proton., space inversion., poise2., Biochemistry. , proline., Chemistry. , para-1 (def. 2)., Military. , (in designations of fighter aircraft) pursuit:\nP-38., father., Music. , softly (def. 2)., after., page., part., participle., past., Chess. , pawn., penny; pence., per., Grammar. , person., peseta., peso., pint., pipe., Baseball. , pitcher., pole., population., president., pressure., purl., father., pastor., peseta., peso., post., president., pressure., priest., prince., progressive., the 16th letter and 12th consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiceless bilabial stop, as in pig, mind one's p's and q's , to be careful to behave correctly and use polite or suitable language, (in Britain) penny or pence, music , piano: an instruction to play quietly, pico-, physics, momentum, proton, pressure, chem , phosphorus, physics, pressure, power, parity, poise, (on road signs) parking, chess , pawn, currency , (the former) peseta, peso, pataca, pula, Portugal (international car registration), pharmacy only: used to label medicines that can be obtained without a prescription, but only at a shop at which there is a pharmacist, short for para- 1 (def. 6), plural pp , page, part, participle, past, per, post, pro"
  },
  {
    "word": "q",
    "meaning": "the 17th letter of the English alphabet, a consonant., any spoken sound represented by the letter Q or q, as in quick, acquit, or Iraq., something having the shape of a Q., a written or printed representation of the letter Q or q., a device, as a printer's type, for reproducing the letter Q or q., quarterly., Chess. , queen (def. 6)., the 17th in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 500., Biochemistry. , glutamine., Physics. , heat (def. 7)., Thermodynamics. , a unit of heat energy, equal to 1018 British thermal units (1.055 × 1021 joules)., Also called Q-factor .Electronics. , the ratio of the reactance to the resistance of an electric circuit or component., Biblical Criticism. , the symbol for material common to the Gospels of Matthew and Luke that was not derived from the Gospel of Mark., farthing., quart; quarts., query., question., quintal., quire., quarto., Quebec., Queen., question., (in Guatemala) quetzal; quetzals., quintal, the 17th letter and 13th consonant of the modern English alphabet, a speech sound represented by this letter, in English usually a voiceless velar stop, as in unique and quick, chess , queen, question, physics , heat, text messaging , queue, quart, quarter, quarterly, quartermaster, Also: q plural Qq or qq , quarto, Queen, question"
  },
  {
    "word": "r",
    "meaning": "the theoretical intrinsic rate of increase of a population, equivalent to the difference between the birth and death rates divided by the number of individuals in the population., radius., Commerce. , registered (def. 2)., Electricity. , resistance., Physics. , roentgen (def. 2)., royal., ruble., plural rs, , rupee. , the 18th letter of the English alphabet, a consonant., any spoken sound represented by the letter R or r, as in ran, carrot, or rhyme., something having the shape of R., a written or printed representation of the letter R or r., a device, as a printer's type, for reproducing the letter R or r., three R's., Informal. , are:\nOysters R in season., Trademark. , restricted: a rating assigned to a movie by the MPA indicating that children under the age of 17 will not be admitted to a theater showing the film unless accompanied by an adult., Chemistry. , radical., Mathematics. , ratio., regular: a man's suit or coat size., Electricity. , resistance., Theater. , stage right., Physics. , roentgen., Chess. , rook., the 18th in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 80., Biochemistry. , arginine., Physics. , universal gas constant., registered trademark: , written as superscript ® following a name registered with the U.S. Patent and Trademark Office., rabbi., railroad., railway., range., rare., Commerce. , received., recipe., replacing., residence., right., rises., river., road., rod., royal., rubber., ruble., Baseball. , run; runs., plural rs. , rupee., (in prescriptions) take., rabbi., Radical., radius., railroad., railway., (in South Africa) rand; rands., Réaumur., rector., redactor., regina., Republican., response., rex., river., road., royal., ruble., rupee., Theater. , stage right., the 18th letter and 14th consonant of the modern English alphabet, a speech sound represented by this letter, in English usually an alveolar semivowel, as in red, See three Rs, chem , radical, currency, rand, rupee, Réaumur temperature (scale), physics electronics , resistance, roentgen or röntgen, chess , rook, Royal, chem , gas constant, (in the US and Australia) , restricted exhibition (used to describe a category of film certified as unsuitable for viewing by anyone under the age of 18), (as modifier), rare, recto, Also: r , rod (unit of length), ruled, cricket baseball , run(s), registered (trademark), right, river, rouble, rabbi, rector, Regina, Republican, response (in Christian liturgy), Rex, River, Royal, Abbreviation of radius"
  },
  {
    "word": "s",
    "meaning": "satisfactory., signature., small., soft., south., second., an ending used in writing to represent the possessive morpheme after most singular nouns, some plural nouns, especially those not ending in a letter or combination of letters representing an s or z sound, noun phrases, and noun substitutes, as in man's, women's, baby's, James's, witness's, (or witness'), king of England's, or anyone's., contraction of is:\nShe's here., contraction of does:\nWhat's he do for a living now?, contraction of has:\nHe's just gone., a contraction of God's, as in 'swounds; 'sdeath; 'sblood., a contraction of us, as in Let's go., a contraction of as, as in so's to get there on time., the 19th letter of the English alphabet, a consonant., any spoken sound represented by the letter S or s, as in saw, sense, or goose., something having the shape of an S., a written or printed representation of the letter S or s., a device, as a printer's type, for reproducing the letter S or s., satisfactory., Baseball. , sacrifice (def. 6)., Baseball. , save1 (def. 17)., Saxon., sentence., short., Electricity. , siemens. , signature., single., small., soft., Music. , soprano., South., Southern., state (highway)., Grammar. , subject., the 19th in order or in a series, (sometimes lowercase) , the medieval Roman numeral for 7 or 70., second., Biochemistry. , serine., Thermodynamics. , entropy (def. 1b)., Physics. , strangeness (def. 2)., Chemistry. , sulfur (def. 1). , a native English suffix used in the formation of adverbs:\nalways; betimes; needs; unawares., an ending marking the third person singular indicative active of verbs:\nwalks., an ending marking nouns as plural (boys; wolves), occurring also on nouns that have no singular (dregs; entrails; pants; scissors), or on nouns that have a singular with a different meaning (clothes; glasses; manners; thanks). The pluralizing value of -s3 is weakened or lost in a number of nouns that now often take singular agreement, as the names of games (billiards; checkers; tiddlywinks) and of diseases (measles; mumps; pox; rickets); the latter use has been extended to create informal names for a variety of involuntary conditions, physical or mental (collywobbles; d.t.'s; giggles; hots; willies). A parallel set of formations, where -s3 has no plural value, are adjectives denoting socially unacceptable or inconvenient states (bananas; bonkers; crackers; nuts; preggers; starkers); cf. -ers., a suffix of hypocoristic nouns, generally proper names or forms used only in address:\nBabs; Fats; Suzykins; Sweetums; Toodles., saint., school., second., section., see., series., shilling; shillings., sign., signed., silver., singular., sire., small., society., son., south., southern., steamer., stem., stem of., substantive., (in prescriptions) mark; write; label., (in prescriptions) let it be written., Fellow., Sabbath., Saint., Saturday., Saxon., (in Austria) schilling; schillings., School., Sea., Senate., September., shilling; shillings., Signor., Small., Socialist., Society., sol3 (def. 1). , South., Southern., (in Ecuador) sucre; sucres., Sunday., second (of time), the 19th letter and 15th consonant of the modern English alphabet, a speech sound represented by this letter, usually an alveolar fricative, either voiceless, as in sit, or voiced, as in dogs, something shaped like an S, (in combination), satisfactory, Society, small (size), South, chem , sulphur, physics , entropy, siemens, strangeness, currency , (the former) schilling, sol, (the former) sucre, Sweden (international car registration), forming the possessive singular of nouns and some pronouns, forming the possessive plural of nouns whose plurals do not end in -s, forming the plural of numbers, letters, or symbols, informal , contraction of is or has, informal , contraction of us with let, informal , contraction of does in some questions, forming the possessive of plural nouns ending in the sound s or z and of some singular nouns, forming the plural of most nouns, forming the third person singular present indicative tense of verbs, forming nicknames and names expressing affection or familiarity, see, semi-, shilling, singular, son, succeeded, plural SS , Saint, school, Sea, Signor, Society, Abbreviation of second (of time), second (of an arc)"
  },
  {
    "word": "t",
    "meaning": "a random variable having Student's t distribution., the statistic employed in Student's t-test., a shortened form of it, before or after a verb, as in 'twas, 'tis, do't, see't., the 20th letter of the English alphabet, a consonant., any spoken sound represented by the letter T or t, as in tub, but, or butter., something having the shape of a T., a written or printed representation of the letter T or t., a device, as a printer's type, for reproducing the letter T or t., T-shirt., (used in combination) tera-., Electricity. , tesla; teslas., temperature (def. 1)., the 20th in order or in a series., (sometimes lowercase) , the medieval Roman numeral for 160., surface tension., Chemistry. , tritium. , Biochemistry., threonine., thymine., Photography. , T number., Physics. , tau lepton. , time reversal. , the launching time of a rocket or missile: T minus two., Chemistry. , tertiary., U.S. Military. , (in designations of aircraft) trainer:\nT-11., variant of -ed1 used in forming the past tense or past participle of certain verbs, usually occurring when the final consonant of the stem is voiceless, a lateral, or a nasal and there is internal vowel change in the root:\nslept; felt; dreamt., in the time of., Football. , tackle., taken from., tare., teaspoon; teaspoonful., temperature., tenor., Grammar. , tense., territory., time., tome., ton., town., township., transit., transitive., troy., tablespoon; tablespoonful., Territory., Township., Tuesday., the 20th letter and 16th consonant of the modern English alphabet, a speech sound represented by this letter, usually a voiceless alveolar stop, as in tame, something shaped like a T, (in combination), to a T , in every detail; perfectly, tonne(s), troy (weight), statistics , distribution, statistics See Student's t, it, absolute temperature, tera-, chem , tritium, biochem , thymine, tesla, surface tension, Thailand (international car registration), trainer (aircraft), commerce , tare, teaspoon(ful), temperature, music , tempo, tenor, grammar , tense, ton(s), transitive, Abbreviation of temperature, tesla, thymine, The symbol for the isotope tritium."
  },
  {
    "word": "u",
    "meaning": "the 21st letter of the English alphabet, a vowel., any spoken sound represented by the letter U or u, as in music, rule, curious, put, or jug., something having the shape of a U., a written or printed representation of the letter U or u., a device, as a printer's type, for reproducing the letter U or u., you:\nShoes Fixed While U Wait., characteristic of or appropriate to the upper class, especially of Great Britain., a Burmese title of respect applicable to a man: used before the proper name., (on a packaged product) certified as kosher by the Union of Orthodox Hebrew Congregations., the 21st in order or in a series., Chemistry. , uranium., Biochemistry. , uracil., Thermodynamics. , internal energy., British. , a designation for motion pictures determined as being acceptable for viewing by all age groups., and., uniform., unit., unsatisfactory., upper., and., uncle., uniform., union., unit., united., university., unsatisfactory., upper., the 21st letter and fifth vowel of the modern English alphabet, any of several speech sounds represented by this letter, in English as in mute, cut, hurt, sure, pull, or minus, something shaped like a U, (in combination), united, unionist, university, (in Britain), universal (used to describe a category of film certified as suitable for viewing by anyone), (as modifier), chem , uranium, biochem , uracil, text messaging , you, British old-fashioned, informal , (esp of language habits) characteristic of or appropriate to the upper class, a Burmese title of respect for men, equivalent to Mr, maths , union, unit, united, university, upper, Abbreviation of uracil"
  }
]